---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndRefelementEnd
source: html/c487e529-0eb7-318e-4fef-90cba98187ec.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndRefelementEnd Property

"End of Attachment to Reference Element"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentEndRefelementEnd { get; }
```